/*
 * Copyright (c) 2021-2025 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_MTGV2_H
#define HPM_MTGV2_H

typedef struct {
    struct {
        __RW uint32_t CONTROL;                 /* 0x0: tra_control */
        __RW uint32_t SHIFT;                   /* 0x4: tra_shift */
        __RW uint32_t LINK;                    /* 0x8: tra_link */
        __R  uint8_t  RESERVED0[20];           /* 0xC - 0x1F: Reserved */
        struct {
            __RW uint32_t CONTROL;             /* 0x20: tra_cmd_control */
            __RW uint32_t REV_PRESET;          /* 0x24: tra_cmd_rev_preset */
            __RW uint32_t POS_PRESET;          /* 0x28: tra_cmd_pos_preset */
            __RW uint32_t VEL_PRESET;          /* 0x2C: tra_cmd_vel_preset */
            __RW uint32_t ACC_PRESET;          /* 0x30: tra_cmd_acc_preset */
            __RW uint32_t JER_PRESET;          /* 0x34: tra_cmd_jer_preset */
            __R  uint32_t TIMESTAMP;           /* 0x38: tra_cmd_timestamp */
            __R  uint8_t  RESERVED0[4];        /* 0x3C - 0x3F: Reserved */
        } CMD[4];
        __R  uint32_t LOCK_REV;                /* 0xA0: tra_lock_rev */
        __R  uint32_t LOCK_POS;                /* 0xA4: tra_lock_pos */
        __R  uint32_t LOCK_VEL;                /* 0xA8: tra_lock_vel */
        __R  uint32_t LOCK_ACC;                /* 0xAC: tra_lock_acc */
        __R  uint32_t LOCK_TIME;               /* 0xB0: tra_lock_time */
        __R  uint8_t  RESERVED1[12];           /* 0xB4 - 0xBF: Reserved */
        __RW uint32_t STEP_LIMIT_CTRL;         /* 0xC0: tra_step_limit_ctrl */
        __RW uint32_t VEL_STEP_MAX;            /* 0xC4: tra_vel_step_max */
        __RW uint32_t VEL_STEP_MIN;            /* 0xC8: tra_vel_step_min */
        __RW uint32_t POS_STEP_MAX;            /* 0xCC: tra_pos_step_max */
        __RW uint32_t POS_STEP_MIN;            /* 0xD0: tra_pos_step_min */
        __RW uint32_t VEL_LIMIT_P;             /* 0xD4: tra_vel_limit_p */
        __RW uint32_t VEL_LIMIT_N;             /* 0xD8: tra_vel_limit_n */
        __R  uint8_t  RESERVED2[3876];         /* 0xDC - 0xFFF: Reserved */
    } TRA[2];
    struct {
        __RW uint32_t CONTROL;                 /* 0x2000: event_control */
        __RW uint32_t PRESET_0;                /* 0x2004: event_preset_0 */
        __RW uint32_t PRESET_1;                /* 0x2008: event_preset_1 */
        __RW uint32_t PRESET_2;                /* 0x200C: event_preset_2 */
        __RW uint32_t PRESET_3;                /* 0x2010: event_preset_3 */
        __R  uint32_t TIMESTAMP;               /* 0x2014: event_timestamp */
        __R  uint8_t  RESERVED0[8];            /* 0x2018 - 0x201F: Reserved */
    } EVENT[4];
    __RW uint32_t SW_EVENT;                    /* 0x2080: sw_event */
    __W  uint32_t SW_GLB_RESET;                /* 0x2084: sw_glb_reset */
    __RW uint32_t IRQ_ENABLE;                  /* 0x2088: irq_enable */
    __W  uint32_t IRQ_STATUS;                  /* 0x208C: irq_status */
    __R  uint8_t  RESERVED0[3952];             /* 0x2090 - 0x2FFF: Reserved */
    __RW uint32_t FILTER_CONTROL;              /* 0x3000: filter_control */
    __R  uint8_t  RESERVED1[20];               /* 0x3004 - 0x3017: Reserved */
    __RW uint32_t FILTER_VEL_FF;               /* 0x3018: filter_vel_ff */
    __RW uint32_t FILTER_ACC_FF;               /* 0x301C: filter_acc_ff */
    __R  uint8_t  RESERVED2[8];                /* 0x3020 - 0x3027: Reserved */
    __RW uint32_t FILTER_TIME_CONSTANT_TP;     /* 0x3028: filter_time_constant_tp */
    __RW uint32_t FILTER_TIME_CONSTANT_TZ;     /* 0x302C: filter_time_constant_tz */
    __RW uint32_t FILTER_TIME_CONSTANT_TZ_1;   /* 0x3030: filter_time_constant_tz_1 */
    __R  uint8_t  RESERVED3[4];                /* 0x3034 - 0x3037: Reserved */
    __RW uint32_t FILTER_GAIN;                 /* 0x3038: filter_gain */
    __RW uint32_t FILTER_STAGE_SHIFT0;         /* 0x303C: filter_stage_shift0 */
    __RW uint32_t FILTER_STAGE_SHIFT1;         /* 0x3040: filter_stage_shift1 */
    __RW uint32_t FILTER_PARAM_SHIFT;          /* 0x3044: filter_param_shift */
    __RW uint32_t FILTER_TIME_SHIFT;           /* 0x3048: filter_time_shift */
    __RW uint32_t FILTER_FF_SHIFT;             /* 0x304C: filter_ff_shift */
    __RW uint32_t FILTER_TIME1_SW_ADJUST;      /* 0x3050: filter_time1_sw_adjust */
    __RW uint32_t FILTER_TIME0_SW_ADJUST;      /* 0x3054: filter_time0_sw_adjust */
    __R  uint8_t  RESERVED4[20];               /* 0x3058 - 0x306B: Reserved */
    __RW uint32_t FILTER_TIMEOUT_CNT;          /* 0x306C: filter_timeout_cnt */
    __R  uint32_t FILTER_REV_LOCK;             /* 0x3070: filter_rev_lock */
    __R  uint32_t FILTER_POS_LOCK;             /* 0x3074: filter_pos_lock */
    __R  uint32_t FILTER_VEL_LOCK;             /* 0x3078: filter_vel_lock */
    __R  uint32_t FILTER_ACC_LOCK;             /* 0x307C: filter_acc_lock */
} MTGV2_Type;


/* Bitfield definition for register of struct array TRA: CONTROL */
/*
 * SW_LOCK (RW)
 *
 */
#define MTGV2_TRA_CONTROL_SW_LOCK_MASK (0x2U)
#define MTGV2_TRA_CONTROL_SW_LOCK_SHIFT (1U)
#define MTGV2_TRA_CONTROL_SW_LOCK_SET(x) (((uint32_t)(x) << MTGV2_TRA_CONTROL_SW_LOCK_SHIFT) & MTGV2_TRA_CONTROL_SW_LOCK_MASK)
#define MTGV2_TRA_CONTROL_SW_LOCK_GET(x) (((uint32_t)(x) & MTGV2_TRA_CONTROL_SW_LOCK_MASK) >> MTGV2_TRA_CONTROL_SW_LOCK_SHIFT)

/*
 * OVALID_CLEAR (WO)
 *
 */
#define MTGV2_TRA_CONTROL_OVALID_CLEAR_MASK (0x1U)
#define MTGV2_TRA_CONTROL_OVALID_CLEAR_SHIFT (0U)
#define MTGV2_TRA_CONTROL_OVALID_CLEAR_SET(x) (((uint32_t)(x) << MTGV2_TRA_CONTROL_OVALID_CLEAR_SHIFT) & MTGV2_TRA_CONTROL_OVALID_CLEAR_MASK)
#define MTGV2_TRA_CONTROL_OVALID_CLEAR_GET(x) (((uint32_t)(x) & MTGV2_TRA_CONTROL_OVALID_CLEAR_MASK) >> MTGV2_TRA_CONTROL_OVALID_CLEAR_SHIFT)

